# Naive Bayes Classifier

## here we do prediction in titanic datasets

## 1. Import important libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

## 2. Import dataset

In [2]:
df = pd.read_csv('D:\\Akash\\Machine Learning\\Data_for_ML\\titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

## 3. Drop unwanted column

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

## 4. Change alphabet column into numeric symbol
### we use dummie variables here

In [4]:
dumies = pd.get_dummies(df.Sex)
df = pd.concat([df , dumies] ,axis='columns')
df.head()

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0
2       3  female  26.0   7.9250         1       1     0
3       1  female  35.0  53.1000         1       1     0
4       3    male  35.0   8.0500         0       0     1

In [5]:
df.drop(['Sex'], axis='columns',inplace=True)
df.head()

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1

## 5. divide our datasets into two category - input and target

In [6]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

## 6. Fix the Null data problem (if any)

In [7]:
inputs.columns[inputs.isna().any()] # find any null value in datasets

Index(['Age'], dtype='object')

In [8]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

## 7. train test splitting of datasets

In [9]:
from sklearn.model_selection import train_test_split
x_train , x_test , y_train , y_test = train_test_split(inputs , target , test_size=0.2)

## 8. Import the model and fit the datasets

In [10]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

model.fit(x_train , y_train)

GaussianNB()

In [11]:
model.score(x_test , y_test)

0.7597765363128491

In [12]:
x_test[:10]

     Pclass        Age     Fare  female  male
839       1  29.699118  29.7000       0     1
320       3  22.000000   7.2500       0     1
391       3  21.000000   7.7958       0     1
92        1  46.000000  61.1750       0     1
775       3  18.000000   7.7500       0     1
844       3  17.000000   8.6625       0     1
196       3  29.699118   7.7500       0     1
466       2  29.699118   0.0000       0     1
528       3  39.000000   7.9250       0     1
367       3  29.699118   7.2292       1     0

In [13]:
y_test[:10]

839    1
320    0
391    1
92     0
775    0
844    0
196    0
466    0
528    0
367    1
Name: Survived, dtype: int64

In [14]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 1], dtype=int64)